app/controllers/guests_controller.rb

  def index
    @guests = Guest.all
---
SELECT * FROM "guests"

  def show
    @guest = Guest.find(params[:id])
---
SELECT * FROM "guests" WHERE ("guests"."id" = 1)

  def edit
    @guest = Guest.find(params[:id])
---
SELECT * FROM "guests" WHERE ("guests"."id" = 3)

  def create
    @guest = Guest.new(params[:guest])

    respond_to do |format|
      if @guest.save
---
INSERT INTO "guests" ("created_at", "prefix", "updated_at", "last_name", "first_name", "email") VALUES('2009-07-10 19:37:46', NULL, '2009-07-10 19:37:46', 'Farnsworth', 'Adam', 'bulk@adamfarnsworth.com')

  def update
    @guest = Guest.find(params[:id])

    respond_to do |format|
      if @guest.update_attributes(params[:guest])
---
SELECT * FROM "guests" WHERE ("guests"."id" = 1)
UPDATE "guests" SET "prefix" = 'Mr. ', "updated_at" = '2009-07-27 18:59:08' WHERE "id" = 1

  def destroy
    @guest = Guest.find(params[:id])
    @guest.destroy
---
SELECT * FROM "guests" WHERE ("guests"."id" = 3)
DELETE FROM "guests" WHERE "id" = 3