app/controllers/sessions_controller.rb

  def create
    if @guest = Guest.find_for_login(params[:guest][:last_name], params[:guest][:pin])
---
SELECT * FROM "guests" WHERE ("guests"."pin" = '2584' AND "guests"."last_name" = 'Reedy') LIMIT 1